Tekla Open API Reference for Tekla Structures 2025
Picker.PickPoint Method (String)
 Queries the user to pick a point from the model with the given prompt.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point PickPoint(
	string Prompt
)
Public Function PickPoint (
	Prompt As String
) As Point
Parameters
Prompt
Type: System.String
The string to display as user guidance.
Return Value
Type: Point
The point the user picked.
See Also
Reference
Picker Class
PickPoint Overload
Tekla.Structures.Model.UI Namespace